___

<p style="text-align: center;"><img src="https://docs.google.com/uc?id=1lY0Uj5R04yMY3-ZppPWxqCr5pvBLYPnV" class="img-fluid" alt="Rossum"></p>

In this assignment you will start off with Numpy Exercises and then complete the whole Exercise with Pandas questions. All the subjects related to questions here already covered in preclass materials and in-class sessions. So good luck!

# Pandas Section

In [1]:
import pandas as pd

**Read Salaries.csv take a look at first 5 rows, df info and df statistical measurements**

In [2]:
df = pd.read_csv("Salaries/Salaries.csv", sep=",")
df.head(5)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148650 non-null  float64
 6   Benefits          112491 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            0 non-null       float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

In [4]:
df.describe()

,Id,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Status
count,148654.000000,148045.000000,148650.000000,148650.000000,112491.000000,148654.000000,148654.000000,148654.000000,0.0,0.0
mean,74327.500000,66325.448841,5066.059886,3648.767297,25007.893151,74768.321972,93692.554811,2012.522643,NaN,NaN
std,42912.857795,42764.635495,11454.380559,8056.601866,15402.215858,50517.005274,62793.533483,1.117538,NaN,NaN
min,1.000000,-166.010000,-0.010000,-7058.590000,-33.890000,-618.130000,-618.130000,2011.000000,NaN,NaN
25%,37164.250000,33588.200000,0.000000,0.000000,11535.395000,36168.995000,44065.650000,2012.000000,NaN,NaN
50%,74327.500000,65007.450000,0.000000,811.270000,28628.620000,71426.610000,92404.090000,2013.000000,NaN,NaN
75%,111490.750000,94691.050000,4658.175000,4236.065000,35566.855000,105839.135000,132876.450000,2014.000000,NaN,NaN
max,148654.000000,319275.010000,245131.880000,400184.250000,96570.660000,567595.430000,567595.430000,2014.000000,NaN,NaN

**How many different year value are there**

In [5]:
df["Year"].value_counts()

2014    38123
2013    37606
2012    36766
2011    36159
Name: Year, dtype: int64

**Print out max and avg Totalpay**

In [6]:
df["TotalPay"].max()

567595.43

In [7]:
avg = df["TotalPay"].mean()
avg

74768.321971703

**How many records are there which have TotalPay bigger than avg TotalPay**

In [8]:
type(df[df.TotalPay > avg])

pandas.core.frame.DataFrame

In [9]:
len(df[df["TotalPay"]>avg])

69489

**How much does ALBERT PARDINI make (including benefits)?**

In [10]:

fil = df.loc[df["EmployeeName"]=="ALBERT PARDINI"]
fil["TotalPayBenefits"]

2    335279.91
Name: TotalPayBenefits, dtype: float64

**Who is lowest paid person**

In [11]:
lowest = df["TotalPayBenefits"].min()
lowest

-618.13

In [12]:
a = df.loc[df["TotalPayBenefits"]==lowest]
a.iloc[:,0:2]

            Id EmployeeName
148653  148654    Joe Lopez

In [132]:
##############

**What are the unique Jobs in dataset?**

In [13]:
df["JobTitle"].unique()

array(['GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY',
       'CAPTAIN III (POLICE DEPARTMENT)',
       'WIRE ROPE CABLE MAINTENANCE MECHANIC', ..., 'Conversion',
       'Cashier 3', 'Not provided'], dtype=object)

**List 3 least common Jobs**

In [15]:
a = df.groupby("JobTitle").apply(len).value_counts
a

<bound method IndexOpsMixin.value_counts of JobTitle
ACCOUNT CLERK                                      83
ACCOUNTANT                                          5
ACCOUNTANT INTERN                                  48
ACPO,JuvP, Juv Prob (SFERS)                         1
ACUPUNCTURIST                                       1
                                                 ...
X-RAY LABORATORY AIDE                              26
X-Ray Laboratory Aide                             100
YOUTH COMMISSION ADVISOR, BOARD OF SUPERVISORS      1
Youth Comm Advisor                                  4
ZOO CURATOR                                         1
Length: 2159, dtype: int64>

In [16]:
a = df[df["JobTitle"]=="ZOO CURATOR"]
a.tail(10)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
18778,18779,MYRON SULAK,ZOO CURATOR,43148.0,0.0,23538.56,NaN,66686.56,66686.56,2011,NaN,San Francisco,NaN

In [17]:
a = df[df["JobTitle"]=="TRAFFIC SIGN MANAGER"]
a.tail(10)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
9563,9564,MICHAEL MACARIO,TRAFFIC SIGN MANAGER,99415.01,0.0,360.0,NaN,99775.01,99775.01,2011,NaN,San Francisco,NaN

In [18]:
df["JobTitle"].value_counts()

Transit Operator                          7036
Special Nurse                             4389
Registered Nurse                          3736
Public Svc Aide-Public Works              2518
Police Officer 3                          2421
                                          ...
MEDIA/SECURITY SYSTEMS SUPERVISOR            1
HH Mechanical Shop Sprv                      1
DIRECTOR, INFORMATION TECHNOLOGY GROUP       1
SENIOR EMPLOYEE ASSISTANCE COUNSELOR         1
Cashier 3                                    1
Name: JobTitle, Length: 2159, dtype: int64

In [19]:
df["JobTitle"].sort_values()

24456          ACCOUNT CLERK
35637          ACCOUNT CLERK
26437          ACCOUNT CLERK
24574          ACCOUNT CLERK
26235          ACCOUNT CLERK
                 ...
98074     Youth Comm Advisor
138458    Youth Comm Advisor
103333    Youth Comm Advisor
58842     Youth Comm Advisor
18778            ZOO CURATOR
Name: JobTitle, Length: 148654, dtype: object

In [20]:
a = "LEGISLATION CLERK" in df["JobTitle"].value_counts()

In [21]:
b = df["JobTitle"].value_counts(ascending= True)
b

Cashier 3                          1
LEGISLATIVE CALENDAR CLERK         1
SENIOR PLAN CHECKER                1
SPECIAL ASSISTANT XVIII            1
DIRECTOR, PROBATION SERVICES       1
                                ...
Police Officer 3                2421
Public Svc Aide-Public Works    2518
Registered Nurse                3736
Special Nurse                   4389
Transit Operator                7036
Name: JobTitle, Length: 2159, dtype: int64

In [22]:
"Sheriff" in df["JobTitle"].value_counts()

True

In [23]:
"MATERIALS AND SUPPLIES SUPERVISOR" in df["JobTitle"].value_counts()

True

In [148]:
###############

LEGISLATION CLERK                    1
Sheriff                              1
MATERIALS AND SUPPLIES SUPERVISOR    1
Name: JobTitle, dtype: int64

**How many people earned more than avg in 2012**

In [24]:
# 2012 yılı ortalamasından daha yüksek kazananlar
avg = df.groupby("Year")["TotalPay"].mean()
avg

Year
2011    71744.103871
2012    74113.262265
2013    77611.443142
2014    75463.918140
Name: TotalPay, dtype: float64

In [25]:
count = df[["EmployeeName","Year","TotalPay"]][df["TotalPay"]>avg[2012]]
count

             EmployeeName  Year   TotalPay
0          NATHANIEL FORD  2011  567595.43
1            GARY JIMENEZ  2011  538909.28
2          ALBERT PARDINI  2011  335279.91
3       CHRISTOPHER CHONG  2011  332343.61
4         PATRICK GARDNER  2011  326373.19
...                   ...   ...        ...
135701    Christina S Jee  2014   77186.02
135778  Mary Ann T Abille  2014   76746.22
135847   Emilda E Reinosa  2014   76305.74
135853      David G Evans  2014   76280.70
136063         Nicole Joe  2014   74893.70

[70388 rows x 3 columns]

In [26]:
avg = df["TotalPay"].mean()
avg

74768.321971703

In [27]:
count = df[["EmployeeName","Year","TotalPay"]][(df["TotalPay"]>avg) & (df["Year"]==2012)]
count

             EmployeeName  Year   TotalPay
36159      Gary Altenberg  2012  362844.66
36160        Gregory Suhr  2012  321552.11
36161          Khoa Trinh  2012  336393.73
36162  Joanne Hayes-White  2012  314759.60
36163   Frederick Binkley  2012  337204.86
...                   ...   ...        ...
60070     Leeanne Mercier  2012   75028.74
60463       Carol Pirolli  2012   77993.23
60717      Jocelyn Weiler  2012   77354.06
60733        Diana Edward  2012   77269.21
60900       Mary Ann Hauf  2012   76451.34

[16716 rows x 3 columns]

AttributeError: 'float' object has no attribute 'loc'

In [162]:
###############?????

20366

**How many people have the word Manager in their job title?**

In [76]:
a = df[df["JobTitle"].str.contains("Manager",na=False)].apply(len)

b = df[df["JobTitle"].str.contains("MANAGER",na=False)].apply(len)

print(a)
print()
print(b)
c = a+b
c["JobTitle"]

Id                  3080
EmployeeName        3080
JobTitle            3080
BasePay             3080
OvertimePay         3080
OtherPay            3080
Benefits            3080
TotalPay            3080
TotalPayBenefits    3080
Year                3080
Notes               3080
Agency              3080
Status              3080
dtype: int64

Id                  1030
EmployeeName        1030
JobTitle            1030
BasePay             1030
OvertimePay         1030
OtherPay            1030
Benefits            1030
TotalPay            1030
TotalPayBenefits    1030
Year                1030
Notes               1030
Agency              1030
Status              1030
dtype: int64

4110

**Take Id,EmployeeName,JobTitle,TotalPay and TotalPayBenefits columns with iloc and assign it as sal_new dataframe**

In [111]:
a = ["Id","EmployeeName","JobTitle","TotalPay","TotalPayBenefits"]
sal_new = df[a]
sal_new

,Id,EmployeeName,JobTitle,TotalPay,TotalPayBenefits
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,567595.43,567595.43
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),538909.28,538909.28
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),335279.91,335279.91
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,332343.61,332343.61
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",326373.19,326373.19
...,...,...,...,...,...
148649,148650,Roy I Tillery,Custodian,0.00,0.00
148650,148651,Not provided,Not provided,0.00,0.00
148651,148652,Not provided,Not provided,0.00,0.00
148652,148653,Not provided,Not provided,0.00,0.00
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",-618.13,-618.13

**Take columns betweeen EmployeeName and TotalPayBenefits with loc and assign it o sal_new df**

In [110]:
a = ["EmployeeName","JobTitle","TotalPay","TotalPayBenefits"]
sal_new = df[a]
sal_new

,EmployeeName,JobTitle,TotalPay,TotalPayBenefits
0,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,567595.43,567595.43
1,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),538909.28,538909.28
2,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),335279.91,335279.91
3,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,332343.61,332343.61
4,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",326373.19,326373.19
...,...,...,...,...
148649,Roy I Tillery,Custodian,0.00,0.00
148650,Not provided,Not provided,0.00,0.00
148651,Not provided,Not provided,0.00,0.00
148652,Not provided,Not provided,0.00,0.00
148653,Joe Lopez,"Counselor, Log Cabin Ranch",-618.13,-618.13

**Print out the names of the employees who earn more than min, but less than avg**

In [96]:
avg = df["TotalPay"].mean()
avg

74768.321971703

In [99]:
minx = df["TotalPay"].min()
minx

-618.13

In [102]:
name = df[["EmployeeName","TotalPay"]][(df["TotalPay"] > minx) & df["TotalPay"]<avg]
name

             EmployeeName   TotalPay
0          NATHANIEL FORD  567595.43
1            GARY JIMENEZ  538909.28
2          ALBERT PARDINI  335279.91
3       CHRISTOPHER CHONG  332343.61
4         PATRICK GARDNER  326373.19
...                   ...        ...
148649      Roy I Tillery       0.00
148650       Not provided       0.00
148651       Not provided       0.00
148652       Not provided       0.00
148653          Joe Lopez    -618.13

[148654 rows x 2 columns]